# Insulation Material Properties

Source: https://www.revitapidocs.com/2026/03a2b9af-3a54-98d7-9bd5-50ab9e2d5579.htm

---

| Insulation Material Properties |
| --- |

The InsulationMaterial type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Insulation Material id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Insulation Material name. |

Top See Also

#### Reference

InsulationMaterial Class Autodesk.Revit.DB.Electrical Namespace